CREATE TABLE IF NOT EXISTS Schedule (
    id UUID PRIMARY KEY DEFAULT gen_random_uuid(),
    title VARCHAR(100) NOT NULL,
    startdate TIMESTAMP NOT NULL,
    finishdate TIMESTAMP,
    middledate TIMESTAMP,
    category VARCHAR(10),
    location VARCHAR(50),
    url_link VARCHAR(100),
    content TEXT,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    updated_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

INSERT INTO Schedule (id, title, startdate, finishdate, category, location, url_link, content, created_at, updated_at) VALUES
('3b4b60c6-3a90-48c9-b8ed-4df5d1231231', '元旦', '2024-1-1', '2024-1-1', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:24.679379', '2025-01-03 12:41:24.679379'),
('4a2b8e87-2c34-490e-80f7-123b456c7890', '建国記念の日', '2024-02-11', '2024-02-11', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:24.679379', '2025-01-03 12:41:24.679379'),
('d5f3ac91-9f64-4b82-b27a-c7d1b3cd5678', '天皇誕生日', '2024-02-23', '2024-02-23', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:34.872312', '2025-01-03 12:41:34.872312'),
('d5f3ac91-9f64-4b82-b27a-c7d1b3cd5679', '春分の日', '2024-03-20', '2024-03-20', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:34.872312', '2025-01-03 12:41:34.872312'),
('6f894bd3-c987-485c-933a-a45b9c123456', '昭和の日', '2024-04-29', '2024-04-29', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('6f894bd3-c987-485c-933a-a45b9c123457', '憲法記念日', '2024-05-03', '2024-05-03', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('6f894bd3-c987-485c-933a-a45b9c123458', 'みどりの日', '2024-05-04', '2024-05-04', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('6f893bd3-c987-485c-933a-a45b9c123458', 'こどもの日', '2024-05-05', '2024-05-05', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('6f894bd3-c987-485c-933a-a45b9c123459', '山の日', '2024-08-11', '2024-08-11', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('6f884bd3-c987-485c-933a-a45b9c123459', '秋分の日', '2024-09-23', '2024-09-23', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('6f894bd3-c987-485c-933a-a45b9c123410', '文化の日', '2024-11-03', '2024-11-03', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('6f894bd3-c987-485c-933a-a45b9c123411', '勤労感謝の日', '2024-11-23', '2024-11-23', '祝日', '', 'http://example.com', '日本の祝日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('5f894bd3-c987-485c-933a-a45b9c123411', '節分', '2024-02-03', '2024-02-03', '祭日', '', 'http://example.com', '日本の祭日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('4f894bd3-c987-485c-933a-a45b9c123411', 'ひな祭り', '2024-03-03', '2024-03-03', '祭日', '', 'http://example.com', '日本の祭日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('3f894bd3-c987-485c-933a-a45b9c123411', '母の日', '2024-05-12', '2024-05-12', '祭日', '', 'http://example.com', '日本の祭日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('2f894bd3-c987-485c-933a-a45b9c123411', '七夕', '2024-07-07', '2024-07-07', '祭日', '', 'http://example.com', '日本の祭日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('1f894bd3-c987-485c-933a-a45b9c123411', '七五三', '2024-11-15', '2024-11-15', '祭日', '', 'http://example.com', '日本の祭日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('0f894bd3-c987-485c-933a-a45b9c123411', 'クリスマス', '2024-12-25', '2024-12-25', '祭日', '', 'http://example.com', '日本の祭日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507'),
('9f894bd3-c987-485c-933a-a45b9c123411', '大晦日', '2024-12-31', '2024-12-31', '祭日', '', 'http://example.com', '日本の祭日', '2025-01-03 12:41:57.507', '2025-01-03 12:41:57.507');


CREATE TABLE IF NOT EXISTS holiday_change (
    id UUID PRIMARY KEY DEFAULT gen_random_uuid(),
    title VARCHAR(100) NOT NULL,
    month INTEGER NOT NULL,
    week INTEGER NOT NULL,
    weekday INTEGER NOT NULL,
    category VARCHAR(10),
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    updated_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

INSERT INTO holiday_change (id, title, month, week, weekday, category, created_at, updated_at) VALUES
('3b4b60c6-4a90-48c9-b8ed-4df5d1231231', '成人式の日', '1', '2', '1', '祝日', '2025-01-03 12:41:24.679379', '2025-01-03 12:41:24.679379'),
('3b4b60c6-5a90-48c9-b8ed-4df5d1231231', '海の日', '7', '3', '1', '祝日', '2025-01-03 12:41:24.679379', '2025-01-03 12:41:24.679379'),
('3b4b60c6-6a90-48c9-b8ed-4df5d1231231', '敬老の日', '9', '3', '1', '祝日', '2025-01-03 12:41:24.679379', '2025-01-03 12:41:24.679379'),
('3b4b60c6-7a90-48c9-b8ed-4df5d1231231', '体育の日', '10', '2', '1', '祝日', '2025-01-03 12:41:24.679379', '2025-01-03 12:41:24.679379');
